app/Http/Controllers/CourseController.php

select * from `categories` where `categories`.`course_category_id` in (1)
select * from `course_categories` where `slug` = 'diosdjap'
select * from `courses` where `courses`.`category_id` in (1)
---
    public function index(Request $request)
    {
        $selectedCategorySlug = $request->query('category');

        // Query top-tier CourseCategories with their middle-tier categories and courses
        $categoriesQuery = CourseCategory::with('categories.courses');

        // If a specific ?category=... slug is passed in the URL, filter to ONLY that CourseCategory
        if ($selectedCategorySlug) {
            $categoriesQuery->where('slug', $selectedCategorySlug);
        }

        $categories = $categoriesQuery->get();