app/Http/Controllers/Admin/CategoryController.php

select * from `categories` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `categories`
---
    public function index()
    {
        $categories = Category::latest()->paginate(10);

select * from `course_categories` order by `name` asc
---
    public function create()
    {
        // Fetch all course categories for the dropdown
        $courseCategories = CourseCategory::orderBy('name')->get();

insert into `categories` (`course_category_id`, `name`, `slug`, `is_active`, `icon_path`, `updated_at`, `created_at`) values ('1', 'CB Bank', 'cb-bank', 1, 'storage/categories/gJPvdAg1ateNpkL7sCN4WQswjm1tgg1H1F9SAUAB.png', '2026-08-17 04:52:58', '2026-08-17 04:52:58')
---
    public function store(Request $request)
    {
        $validated = $request->validate([
            'course_category_id' => 'required|exists:course_categories,id',
            'name'               => 'required|string|max:255|unique:categories,name',
            'icon'               => 'nullable|image|mimes:jpeg,png,jpg,svg,webp|max:2048',
            'is_active'          => 'nullable|boolean',
        ]);

        $category = new Category();
        $category->course_category_id = $validated['course_category_id'];
        $category->name = $validated['name'];
        $category->slug = Str::slug($validated['name']);
        $category->is_active = $request->has('is_active');

        if ($request->hasFile('icon')) {
            $path = $request->file('icon')->store('categories', 'public');
            $category->icon_path = 'storage/' . $path;
        }

        $category->save();