app/Http/Controllers/Admin/CourseController.php

    public function index(Request $request): View
    {
        $query = Course::with('category');

        if ($request->get('filter') === 'latest') {
            $query->latest();
        } else {
            $query->latest();
        }

        $courses = $query->paginate(10)->withQueryString();
---
select * from `courses` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `courses`

    public function store(Request $request): RedirectResponse
    {
        $validated = $request->validate([
            'title'              => 'required|string|max:255',
            'code'               => 'required|string|max:50|unique:courses,code',
            'course_category_id' => 'required|exists:course_categories,id',
            'price'              => 'nullable|numeric|min:0',
            'hour'               => 'required|integer|min:1',
            'desc'               => 'nullable|string',
            'member_price' => 'nullable|numeric|min:0|lte:price',
            'image'              => 'nullable|image|mimes:jpeg,png,jpg,webp|max:2048',
        ]);

        // Map form input 'course_category_id' to database column 'category_id'
        $validated['category_id'] = $validated['course_category_id'];
        unset($validated['course_category_id']);

        $validated['price'] = $validated['price'] ?? 0;

        // Handle Image Upload
        if ($request->hasFile('image')) {
            $validated['image'] = $request->file('image')->store('courses', 'public');
        }

        Course::create($validated);
---
insert into `courses` (`title`, `code`, `price`, `hour`, `desc`, `image`, `updated_at`, `created_at`) values ('ADD', 'Mq-1', '12', '12', 'sdfsdff', 'courses/IdSh4g034GZZN61JnPuydy3kgP8RqZKrdXacvjFi.png', '2026-08-17 05:26:59', '2026-08-17 05:26:59')

    public function edit(Course $course): View
    {
        $categories = CourseCategory::orderBy('name')->get();
---
select * from `course_categories` order by `name` asc