app/Http/Controllers/Admin/CourseCategoryController.php

select count(*) as aggregate from `course_categories`
---
    public function index(Request $request)
    {
        $query = CourseCategory::query();

        if ($request->filled('search')) {
            $query->where('name', 'like', '%' . $request->search . '%');
        }

        $categories = $query->withCount('courses')
                            ->latest()
                            ->paginate(10)
                            ->withQueryString();

insert into `course_categories` (`name`, `slug`, `description`, `updated_at`, `created_at`) values ('Tom', 'tom', 'dafsdfd', '2026-08-17 04:36:54', '2026-08-17 04:36:54')
---
    public function store(Request $request)
    {
        $request->validate([
            'name'        => 'required|string|max:255|unique:course_categories,name',
            'slug'        => 'nullable|string|max:255|unique:course_categories,slug',
            'description' => 'nullable|string',
        ]);

        CourseCategory::create([
            'name'        => $request->name,
            'slug'        => $request->filled('slug') ? Str::slug($request->slug) : Str::slug($request->name),
            'description' => $request->description,
        ]);