app/Http/Controllers/Admin/UserController.php

    public function index(Request $request)
    {
        $query = User::query();

        // Search by name, email, or phone
        if ($request->filled('search')) {
            $search = $request->search;
            $query->where(function ($q) use ($search) {
                $q->where('name', 'like', "%{$search}%")
                  ->orWhere('email', 'like', "%{$search}%")
                  ->orWhere('phone', 'like', "%{$search}%");
            });
        }

        // Filter by auth provider type
        if ($request->filter === 'google') {
            $query->whereNotNull('google_id');
        } elseif ($request->filter === 'standard') {
            $query->whereNull('google_id');
        }

        // Order by latest and paginate
        $users = $query->latest()->paginate(10);
---
select count(*) as aggregate from `users`